import '../domain/entities/surah_entity.dart';

final surahList = [
  SurahEntity(
    name: 'аль-Фатиха',
    ayatCount: '7 аятов',
    id: 1,
    arabicName: 'الفاتحة',
    tafsirText:
        'Всевышний указал Своим верующим рабам на то, как они могут обрести успех и добиться победы над врагом. О верующие! Когда вы встречаетесь с неверующими на поле битвы, то доблестно сражайтесь с ними и рубите им головы. Когда же они прекратят оказывать вам сопротивление и вы предпочтете не убивать их, а пленить, то крепите оковы пленных, чтобы они не могли сбежать. Только так вы сможете обезопасить себя от их мечей и их зла. С пленными вы можете поступать по своему усмотрению: вы можете помиловать их и даровать им свободу, не требуя от них выкупа, а можете поменять их на захваченных в плен мусульман либо потребовать за них выкуп от них и их сторонников. Продолжайте поступать так, пока не завершится война или вы не заключите с противником перемирие. В разных местах следует вести различные разговоры, и в разных обстоятельствах следует придерживаться различных законов, и предписание сражаться с неверующими относится только к военному времени. А в мирное время, когда нет войны и сражений, нельзя ни убивать, ни пленить людей. Так решил Аллах. Он испытывает правоверных, позволяя неверующим сражаться с ними. А если бы Он пожелал, то покарал бы их сам, потому что Всевышний Аллах всемогущ и властен над всем сущим. Он может сделать так, чтобы неверующие не выигрывали ни одного сражения и верующие очистили от них землю, но Он хочет испытать одних из вас посредством других. Для этого Аллах и приказал верующим вести священную войну с неверующими – войну, которая выявляет правдивого верующего от лжеца. В ней рождаются истинные правоверные, чья вера опирается на твердое знание. Они не похожи на тех маловеров, которые слепо подражают большинству и не способны пронести свою веру через трудности и испытания. Аллах никогда не даст сгинуть понапрасну деяниям тех, кто был убит, сражаясь ради Него. Они сражались по Его приказу, стремясь возвысить Его имя. Они получат щедрую награду и прекрасное воздаяние. Их деяния не пропадут даром, ибо Всевышний Аллах примет их и многократно приумножит их награду. Люди же увидят прекрасные плоды их дел как в этом мире, так и в Последней жизни.Всевышний указал Своим верующим рабам на то, как они могут обрести успех и добиться победы над врагом. О верующие! Когда вы встречаетесь с неверующими на поле битвы, то доблестно сражайтесь с ними и рубите им головы. Когда же они прекратят оказывать вам сопротивление и вы предпочтете не убивать их, а пленить, то крепите оковы пленных, чтобы они не могли сбежать. Только так вы сможете обезопасить себя от их мечей и их зла. С пленными вы можете поступать по своему усмотрению: вы можете помиловать их и даровать им свободу, не требуя от них выкупа, а можете поменять их на захваченных в плен мусульман либо потребовать за них выкуп от них и их сторонников. Продолжайте поступать так, пока не завершится война или вы не заключите с противником перемирие. В разных местах следует вести различные разговоры, и в разных обстоятельствах следует придерживаться различных законов, и предписание сражаться с неверующими относится только к военному времени. А в мирное время, когда нет войны и сражений, нельзя ни убивать, ни пленить людей. Так решил Аллах. Он испытывает правоверных, позволяя неверующим сражаться с ними. А если бы Он пожелал, то покарал бы их сам, потому что Всевышний Аллах всемогущ и властен над всем сущим. Он может сделать так, чтобы неверующие не выигрывали ни одного сражения и верующие очистили от них землю, но Он хочет испытать одних из вас посредством других. Для этого Аллах и приказал верующим вести священную войну с неверующими – войну, которая выявляет правдивого верующего от лжеца. В ней рождаются истинные правоверные, чья вера опирается на твердое знание. Они не похожи на тех маловеров, которые слепо подражают большинству и не способны пронести свою веру через трудности и испытания. Аллах никогда не даст сгинуть понапрасну деяниям тех, кто был убит, сражаясь ради Него. Они сражались по Его приказу, стремясь возвысить Его имя. Они получат щедрую награду и прекрасное воздаяние. Их деяния не пропадут даром, ибо Всевышний Аллах примет их и многократно приумножит их награду. Люди же увидят прекрасные плоды их дел как в этом мире, так и в Последней жизни.Всевышний указал Своим верующим рабам на то, как они могут обрести успех и добиться победы над врагом. О верующие! Когда вы встречаетесь с неверующими на поле битвы, то доблестно сражайтесь с ними и рубите им головы. Когда же они прекратят оказывать вам сопротивление и вы предпочтете не убивать их, а пленить, то крепите оковы пленных, чтобы они не могли сбежать. Только так вы сможете обезопасить себя от их мечей и их зла. С пленными вы можете поступать по своему усмотрению: вы можете помиловать их и даровать им свободу, не требуя от них выкупа, а можете поменять их на захваченных в плен мусульман либо потребовать за них выкуп от них и их сторонников. Продолжайте поступать так, пока не завершится война или вы не заключите с противником перемирие. В разных местах следует вести различные разговоры, и в разных обстоятельствах следует придерживаться различных законов, и предписание сражаться с неверующими относится только к военному времени. А в мирное время, когда нет войны и сражений, нельзя ни убивать, ни пленить людей. Так решил Аллах. Он испытывает правоверных, позволяя неверующим сражаться с ними. А если бы Он пожелал, то покарал бы их сам, потому что Всевышний Аллах всемогущ и властен над всем сущим. Он может сделать так, чтобы неверующие не выигрывали ни одного сражения и верующие очистили от них землю, но Он хочет испытать одних из вас посредством других. Для этого Аллах и приказал верующим вести священную войну с неверующими – войну, которая выявляет правдивого верующего от лжеца. В ней рождаются истинные правоверные, чья вера опирается на твердое знание. Они не похожи на тех маловеров, которые слепо подражают большинству и не способны пронести свою веру через трудности и испытания. Аллах никогда не даст сгинуть понапрасну деяниям тех, кто был убит, сражаясь ради Него. Они сражались по Его приказу, стремясь возвысить Его имя. Они получат щедрую награду и прекрасное воздаяние. Их деяния не пропадут даром, ибо Всевышний Аллах примет их и многократно приумножит их награду. Люди же увидят прекрасные плоды их дел как в этом мире, так и в Последней жизни.Всевышний указал Своим верующим рабам на то, как они могут обрести успех и добиться победы над врагом. О верующие! Когда вы встречаетесь с неверующими на поле битвы, то доблестно сражайтесь с ними и рубите им головы. Когда же они прекратят оказывать вам сопротивление и вы предпочтете не убивать их, а пленить, то крепите оковы пленных, чтобы они не могли сбежать. Только так вы сможете обезопасить себя от их мечей и их зла. С пленными вы можете поступать по своему усмотрению: вы можете помиловать их и даровать им свободу, не требуя от них выкупа, а можете поменять их на захваченных в плен мусульман либо потребовать за них выкуп от них и их сторонников. Продолжайте поступать так, пока не завершится война или вы не заключите с противником перемирие. В разных местах следует вести различные разговоры, и в разных обстоятельствах следует придерживаться различных законов, и предписание сражаться с неверующими относится только к военному времени. А в мирное время, когда нет войны и сражений, нельзя ни убивать, ни пленить людей. Так решил Аллах. Он испытывает правоверных, позволяя неверующим сражаться с ними. А если бы Он пожелал, то покарал бы их сам, потому что Всевышний Аллах всемогущ и властен над всем сущим. Он может сделать так, чтобы неверующие не выигрывали ни одного сражения и верующие очистили от них землю, но Он хочет испытать одних из вас посредством других. Для этого Аллах и приказал верующим вести священную войну с неверующими – войну, которая выявляет правдивого верующего от лжеца. В ней рождаются истинные правоверные, чья вера опирается на твердое знание. Они не похожи на тех маловеров, которые слепо подражают большинству и не способны пронести свою веру через трудности и испытания. Аллах никогда не даст сгинуть понапрасну деяниям тех, кто был убит, сражаясь ради Него. Они сражались по Его приказу, стремясь возвысить Его имя. Они получат щедрую награду и прекрасное воздаяние. Их деяния не пропадут даром, ибо Всевышний Аллах примет их и многократно приумножит их награду. Люди же увидят прекрасные плоды их дел как в этом мире, так и в Последней жизни.',
  ),
  SurahEntity(
    name: 'аль-Бакара',
    ayatCount: '286 аятов',
    id: 2,
    arabicName: 'البقرة',
    tafsirText:
        'Толкователи Корана разошлись во мнениях относительно того, как следует понимать последовательность букв, которой открываются некоторые суры. Такие буквы называют «аль-хуруф аль-мукотта’а» (отдельные, разрозненные буквы).',
  ),
  SurahEntity(
    name: 'аль Имран',
    ayatCount: '200 аятов',
    id: 3,
    arabicName: 'آل عمران	',
    tafsirText:
        '«Аллах — нет никого достойного поклонения, кроме Него, Живого», — Который никогда не умрет и Чье существование никогда не закончится.',
  ),
  SurahEntity(
    name: 'Али-Имран',
    ayatCount: '176 аятов',
    id: 4,
    arabicName: 'النساء',
    tafsirText:
        '«О люди! Бойтесь вашего Господа, который создал вас из одного человека»: проявляйте трепет и страх перед Всевышним Аллахом, поклоняясь лишь Ему — Тому, Кто сотворил вас всех из одной основы — вашего отца Адама.',
  ),
  SurahEntity(
    name: 'аль-Маида',
    ayatCount: '120 аятов',
    id: 5,
    arabicName: 'المائدة',
    tafsirText:
        '«О верующие! Выполняйте обещания»: соблюдайте договоры между вами и Аллахом и между вами и другими людьми. Имам Насафи пишет:',
  ),
  SurahEntity(
    name: 'аль-Анам',
    ayatCount: '165 аятов',
    id: 6,
    arabicName: 'الأنعام',
    tafsirText:
        '«Хвала Аллаху»: Всевышний Аллах начинает суру с обучения Своих рабов тому, как нужно восхвалять Творца небес и земли, указывая тем самым, что лишь Он заслуживает полную хвалу и нет у Него сотоварищей.',
  ),
  SurahEntity(
    name: 'аль-Араф',
    ayatCount: '206 аятов',
    id: 7,
    arabicName: 'الأعراف',
    tafsirText:
        'Тебе ниспослано Писание, которое не должно сжимать твою грудь, дабы ты увещевал им и наставлял верующих. В этих аятах Всевышний разъяснил Своему посланнику, да благословит его Аллах и приветствует, величие Корана. Это Славное Писание содержит все, в чем нуждаются рабы Божьи. В нем подробно разъясняются все божественные требования и религиозные предписания. О Мухаммад! Коран не угнетает человека и не порождает сомнения. Напротив, это – Откровение Мудрого и Достохвального Господа и самая правдивая речь.',
  ),
  SurahEntity(
    name: 'аль-Анфаль',
    ayatCount: '75 аятов',
    id: 8,
    arabicName: 'المائدة',
    tafsirText:
        'Трофеями называется имущество неверующих, которым мусульмане овладевают по воле Аллаха, нанося поражение противнику. Эти аяты были ниспосланы после сражения при Бадре, когда мусульмане одолели язычников и овладели первой крупной военной добычей. Между некоторыми мусульманами возникли разногласия по поводу дележа трофеев, и они обратились за советом к Посланнику, да благословит его Аллах и приветствует. Тогда Всевышний Аллах ниспослал эти аяты и разъяснил, как следует делить военную добычу.',
  ),
  SurahEntity(
    name: 'ат-Тавба',
    ayatCount: '129 аятов',
    id: 9,
    arabicName: 'التوبة',
    tafsirText:
        'Аллах и Его посланник, да благословит его Аллах и приветствует, позволили всем многобожникам и неверующим в течение четырех месяцев свободно передвигаться по земле, не опасаясь нападения со стороны мусульман. Им было сообщено, что по истечении этих месяцев мусульмане не будут иметь никаких обязательств перед ними. Это предписание распространялось на всех неверующих, которые заключили с мусульманами мирный договор сроком на четыре месяца или менее того либо заключили мирный договор, не оговоренный временными рамками. ',
  ),
  SurahEntity(
    name: 'Юнус',
    ayatCount: '109 аятов',
    id: 10,
    arabicName: 'يونس',
    tafsirText:
        'Всевышний поведал о том, что Священный Коран преисполнен мудростей и предписаний, свидетельствующих о духовных ценностях, религиозных повелениях и запретах, которые все человечество обязано одобрять, принимать и выполнять. Однако большинство людей отворачивается от этого Писания и не ведает истины.',
  ),
  SurahEntity(
    name: 'Худ',
    ayatCount: '123 аята',
    id: 11,
    arabicName: 'هود',
    tafsirText:
        'Всевышний назвал Священный Коран Великим Писанием и Благородным Откровением, аяты которого прекрасны и совершенны. В нем содержатся правдивые повествования, справедливые повеления и запреты. Его слова красноречивы, а их смысл великолепен. Аллах разъяснил смысл этих аятов самым совершенным образом, ведь среди Его прекрасных имен – Мудрый и Ведающий. ',
  ),
  SurahEntity(
    name: 'Юсуф',
    ayatCount: '111 аятов',
    id: 12,
    arabicName: 'يوسف',
    tafsirText:
        'Всевышний поведал о том, что коранические аяты являются знамениями Ясного Писания, слова и значения которого предельно доступны и понятны. Аллах ниспослал это писание на арабском языке – самом славном и самом ясном из мировых языков. Аллах разъяснил в нем полезные истины, в знании которых нуждаются люди. Эти разъяснения были даны для того, чтобы люди поняли ограничения, поставленные перед ними Всевышним Аллахом, уяснили основные и второстепенные вопросы религии, осмыслили Божьи повеления и запреты. И если люди сумеют понять это, то правильные познания, которыми наполнятся их сердца, принесут свои плоды. А это значит, что они станут вершить праведные деяния и покорятся истине. И если люди будут часто вспоминать о славных и возвышенных значениях коранических откровений, то их разум станет еще более совершенным, а сами они взойдут на более высокую и совершенную ступень.',
  ),
  SurahEntity(
    name: 'ар-Рад',
    ayatCount: '43 аята',
    id: 13,
    arabicName: 'الرعد',
    tafsirText:
        'Всевышний поведал о том, что Священный Коран состоит из аятов, свидетельствующих обо всех основных и второстепенных вопросах религии, в знании которых нуждаются рабы Аллаха. Он также сообщил, что ниспосланное Пророку Мухаммаду, да благословит его Аллах и приветствует, откровение является ясной истиной. Его повествования являются правдивыми, а его повеления и запреты – справедливыми, и подтверждаются они убедительными доводами и неопровержимыми доказательствами. И если человек изучает Коран и постигает коранические науки, то он приобретает истинное знание, которое обязывает его продолжать обучение и выполнять обязательные предписания религии. Однако большинство людей отказывается уверовать в этот Коран. Одни поступают так, потому что являются невежественными людьми. Они отворачиваются от Небесного Откровения, не придавая ему значения. А другие поступают так, потому что являются упорствующими нечестивцами. Одним словом, большинство людей не извлекает пользы из коранических наставлений, потому что они лишены фактора, побуждающего рабов Аллаха прислушаться к этим наставлениям.',
  ),
  SurahEntity(
    name: 'Ибрахим',
    ayatCount: '52 аята',
    id: 14,
    arabicName: 'إبراهيم',
    tafsirText:
        'Всевышний сообщил о том, что Священное Писание было ниспослано Пророку, да благословит его Аллах и приветствует, на благо всего человечества, дабы он вывел людей из мрака невежества, неверия, порочных нравов и грехов к свету знания, веры и праведной морали. Однако люди не смогут добиться того, что угодно Аллаху, без Его соизволения и поддержки. Поведав об этом, Всевышний призвал Своих рабов молить Его о помощи и поддержке. Он также разъяснил, что Священное Писание освещает людям путь, ведущий к обители Божьей милости.',
  ),
  SurahEntity(
    name: 'аль-Хиджр',
    ayatCount: '99 аятов',
    id: 15,
    arabicName: 'الحجر',
    tafsirText:
        'Всевышний подчеркнул величие коранических аятов, обладающих самым прекрасным смыслом и разъясняющих самые важные предписания. Они раскрывают истину самым изящным и доступным образом, что обязывает людей покориться этому Писанию, выполнять его заповеди и принять его с радостью и удовлетворением.',
  ),
  SurahEntity(
    name: 'ан-Нахль',
    ayatCount: '128 аятов',
    id: 16,
    arabicName: 'النحل',
    tafsirText:
        'Всевышний возвестил о том, что Его обещание является истиной и очень скоро сбудется. А все, что непременно сбудется, можно назвать близким. Всевышний также провозгласил, что не имеет никакого отношения к многобожникам, которые приписывают Ему сотоварищей, сына или супругу и равняют Его с творениями. ',
  ),
  SurahEntity(
    name: 'аль-Исра',
    ayatCount: '111 аятов',
    id: 17,
    arabicName: 'الإسراء',
    tafsirText:
        'Всевышний подчеркнул свое совершенство и величие, проявлениями которого являются Его великие деяния и величественные милости. Одним из таких деяний является ночной перенос Пророка Мухаммада из Заповедной мечети в Мекке, самой славной мечети на свете, в мечеть аль-Акса в Иерусалиме, которая также является одной из самых достойных мечетей и пристанищем пророков.',
  ),
  SurahEntity(
    name: 'аль-Кахф',
    ayatCount: '110 аятов',
    id: 18,
    arabicName: 'الكهف',
    tafsirText:
        'Хвала подразумевает восхваление Аллаха посредством Его совершенных качеств, а также зримых и незримых щедрот, благодаря которым люди благоустраивают свою мирскую и духовную жизнь. Безусловно, самой славной из этих милостей является ниспослание рабу и посланнику Аллаха Пророку Мухаммаду, да благословит его Аллах и приветствует, Великого Писания – Священного Корана.',
  ),
  SurahEntity(
    name: 'Марьям',
    ayatCount: '98 аятов',
    id: 19,
    arabicName: 'مريم',
    tafsirText:
        'О Мухаммад! Мы откроем тебе повествование и подробно расскажем тебе о пророке Закарие, его праведных деяниях и славных достоинствах. Воистину, это повествование является назиданием для тех, кто внимает назиданиям, и прекрасным уроком для тех, кто желает следовать истине. Откровения о том, как Аллах проявляет милость по отношению к Своим праведным рабам и как они удостаиваются такого высокого положения, порождают в людях любовь к Нему и побуждают их чаще поминать Его и стремиться познать Его всеми возможными способами.',
  ),
  SurahEntity(
    name: 'Та Ха',
    ayatCount: '135 аятов',
    id: 20,
    arabicName: 'طه',
    tafsirText:
        'Эти буквы называются «разорванными» и не обозначают одно из имен Пророка Мухаммада, да благословит его Аллах и приветствует. Подобным образом начинаются многие коранические суры.',
  ),
  SurahEntity(
    name: 'аль-Анбия',
    ayatCount: '112 аятов',
    id: 21,
    arabicName: 'الأنبياء',
    tafsirText:
        'Из этого аята становится ясно, насколько удивительно поведение людей, которые не извлекают пользы из увещеваний и не прислушиваются к предостережениям. Очень скоро людям предстоит ответить за содеянные злодеяния и получить вознаграждение за совершенные праведные поступки, однако они продолжают пренебрегать тем, ради чего они были сотворены, и отворачиваться от проповедей и наставлений. Они ведут себя так, словно они были сотворены только ради мирской жизни или появились на свет только ради развлечения. Всевышний Аллах продолжает увещевать их посредством проповедей и напоминаний, однако они продолжают пренебрежительно отворачиваться от них. Вот почему далее Аллах сказал:',
  ),
  SurahEntity(
    name: 'аль-Хаджж',
    ayatCount: '78 аятов',
    id: 22,
    arabicName: 'الحج',
    tafsirText:
        'Аллах обратился ко всему человечеству и повелел людям страшиться своего Господа. Он воспитывает их, одаряет их видимыми и невидимыми благами и действительно заслуживает того, чтобы люди страшились Его. А для этого они должны отречься от многобожия, распутства и грехов и по мере своих возможностей выполнять Его повеления. Затем Всевышний Аллах напомнил о событии, которое может подтолкнуть людей к богобоязненности и предостеречь их от ослушания. Он напомнил им о сотрясении Судного дня, которое будет ужасным событием.',
  ),
  SurahEntity(
    name: 'аль-Муминун',
    ayatCount: '118 аятов',
    id: 23,
    arabicName: 'المؤمنون',
    tafsirText:
        'Аллах почтил верующих рабов тем, что упомянул о них в Своем писании. Он поведал о том, что они обретут счастье и преуспеяние, и рассказал, каким образом они добьются этого. Между тем Он призвал людей облагораживать свои души качествами этих праведников. И пусть каждый раб Божий оценивает себя и окружающих по этим аятам. Только так он сумеет определить, насколько сильна или слаба вера его самого и других людей. Всевышний поведал о том, что человеку, чтобы достичь великого успеха и получить все самое заветное и желанное, необходимо уверовать в Него и подтвердить правдивость Его посланников. Далее Он упомянул о безупречных качествах таких верующих:',
  ),
  SurahEntity(
    name: 'ан-Нур	',
    ayatCount: '64 аята',
    id: 24,
    arabicName: 'النور',
    tafsirText:
        'Это – славная сура, которую Мы ниспослали по Своей милости и уберегли от дьяволов. В ней вам предписано, как следует наказывать ослушников, как необходимо приносить свидетельства и многое другое. В ней ниспосланы ясные знамения: важные предписания, повеления и запреты, а также великие мудрости. Быть может, вы призадумаетесь после того, как Мы разъясним вам истину и обучим вас тому, чего вы не знали. Затем Всевышний Аллах начал разъяснять религиозные предписания, о которых Он упомянул выше. Всевышний сказал:',
  ),
  SurahEntity(
    name: 'аль-Фуркан	',
    ayatCount: '77 аятов',
    id: 25,
    arabicName: 'الفرقان	',
    tafsirText:
        'Всевышний поведал о Своем совершенном величии, своих неповторимых качествах, а также своих многочисленных милостях и щедротах. Слово табарака ‘благословен’ подчеркивает величие Всевышнего Аллаха, совершенство Его качеств и безграничность Его добродетели. А что касается величайшей милости Аллаха, то ею, несомненно, является Священный Коран, который назван Различением, потому что благодаря его аятам люди различают между дозволенным и запрещенным, между прямым путем и заблуждением, между счастливыми праведниками и несчастными неверными. ',
  ),
  SurahEntity(
    name: 'аш-Шуара',
    ayatCount: '227 аятов',
    id: 26,
    arabicName: 'الشعراء',
    tafsirText:
        'Всевышний подчеркнул величие аятов последнего Священного Писания, которое разъясняет рабам Аллаха всякую истину, а также содержит в себе знание обо всех божественных требованиях и религиозных предписаниях. Человеку достаточно просто ознакомиться со Священным Кораном, чтобы у него не осталось сомнений в правдивости коранических повествований и мудрости божественных законов. Подобное чудесное воздействие связано с тем, что коранические откровения предельно ясны и имеют прекрасный смысл, а содержащиеся в них религиозные предписания отличаются мудростью и всегда соответствуют тем или иным обстоятельствам. ',
  ),
  SurahEntity(
    name: 'ан-Намль	',
    ayatCount: '93 аята',
    id: 27,
    arabicName: 'النمل',
    tafsirText:
        'Всевышний возвестил Своим рабам о величии последнего Небесного Откровения, назвав его Ясным Писанием. Прекрасные коранические аяты являются величайшими знамениями и ярчайшими доказательствами божественной истины. Они указывают людям путь к самой заветной цели и помогают им обрести чистые намерения, совершать праведные деяния и выделяться благородными качествами. Они содержат правдивые повествования, прекрасные повеления и мудрые запреты, которые отдаляют людей от пагубных поступков и презренных качеств.',
  ),
  SurahEntity(
    name: 'аль-Касас	',
    ayatCount: '88 аятов',
    id: 28,
    arabicName: 'القصص',
    tafsirText:
        'Аяты Корана заслуживают возвеличивания и почитания, потому что разъясняют все, в познании чего нуждаются рабы. Благодаря им люди познают своего Господа и узнают о своих обязанностях перед Ним, учатся отличать праведников от Его ненавистных врагов и узнают о важнейших событиях в истории человечества, а также о его дальнейшей судьбе. Именно Священный Коран сообщает людям о том, какие деяния заслуживают вознаграждения, а какие – наказания. Эти и многие другие вопросы подробно освещаются в писании Аллаха.',
  ),
  SurahEntity(
    name: 'аль-Анкабут',
    ayatCount: '69 аятов',
    id: 29,
    arabicName: 'العنكبوت',
    tafsirText:
        'Всевышний поведал о Своей совершенной мудрости, которая требует от человека, называющего себя правоверным, стойко переносить любые трудности и испытания, которые могут поколебать убежденность слабых людей и маловеров. Только благодаря этим испытаниям можно отличить правдивого верующего от лжеца, и поэтому Всевышний Аллах изначально испытывал мусульман достатком и лишениями, благоденствием и тяготами, радостями и огорчениями, изобилием и нуждой, а также изнурительной борьбой с врагами ислама, в которой мусульманам приходилось отстаивать истину словом и делом. ',
  ),
  SurahEntity(
    name: 'ар-Рум',
    ayatCount: '60 аятов',
    id: 30,
    arabicName: 'الروم',
    tafsirText:
        'В те далекие времена Персия и Византия были двумя величайшими империями на земле. Они вели друг с другом ожесточенные войны и были равными соперниками. Персы исповедовали язычество и поклонялись огню, а византийцы относились к людям Писания и утверждали, что верили в Тору и Евангелие. Безусловно, убеждения византийцев были намного ближе к исламу, чем языческие воззрения персов, и поэтому мусульмане желали византийцам победы над персами.',
  ),
  SurahEntity(
    name: 'Лукман',
    ayatCount: '34 аята',
    id: 31,
    arabicName: 'لقمان',
    tafsirText:
        'Всевышний подчеркнул величие аятов Мудрого Писания. Они совершенны и ниспосланы Мудрым и Всеведущим Аллахом. Их совершенство проявляется в величии, чистоте и ясности коранических выражений, и все это доказывает величие и прелесть смысла Небесного Откровения. Их совершенство также проявляется в том, что они защищены от любых изменений и искажений, добавок и убавлений. Их совершенство также проявляется в том, что они рассказывают о прошлом и будущем и открывают людям частичку сокровенного знания. ',
  ),
  SurahEntity(
    name: 'ас-Саджда	',
    ayatCount: '30 аятов',
    id: 32,
    arabicName: 'السجدة',
    tafsirText:
        'Всевышний поведал о том, что это благородное Писание ниспослано Господом миров, который одарил Свои творения многочисленными щедротами. Одним из самых прекрасных щедрот Господа является это Писание, в котором содержатся знания о том, как можно достичь праведности и благонравия. И хотя в правдивости этого Писания невозможно усомниться, неверующие, которые несправедливо отвергли Пророка Мухаммада, да благословит его Аллах и приветствует, заявляют, что он сам сочинил Священный Коран и лживо приписал его Господу.',
  ),
  SurahEntity(
    name: 'аль-Ахзаб',
    ayatCount: '73 аята',
    id: 33,
    arabicName: 'الأحزاب',
    tafsirText:
        'О Мухаммад! Аллах избрал тебя своим пророком, почтил божественным откровением и превознес над остальными творениями. Посему благодари своего Господа за Его милость и будь богобоязнен. Ты более кого бы то ни было обязан бояться Его и более других заслуживаешь права обладать этим прекрасным качеством. Выполняй Его повеления и не нарушай Его запретов, доводи до сведения рабов Его послание, обучай их божественному Откровению и давай им добрые советы. Не уступай тем, кто помешает тебе выполнить эту великую миссию и отвратить тебя от прямого пути',
  ),
  SurahEntity(
    name: 'Саба',
    ayatCount: '54 аята',
    id: 34,
    arabicName: 'سبأ',
    tafsirText:
        'Хвалой называется прославление похвальных качеств и прекрасных деяний, и возносить хвалу надлежит только одному Аллаху, поскольку все качества Всевышнего Аллаха безупречны, а все Его деяния преисполнены мудрости и заслуживают похвалы и благодарности. В самом начале этой суры Всевышний сообщил, что все творения должны возносить хвалу Аллаху за то, что Ему одному принадлежит все, что на небесах и на земле. Все творения во Вселенной принадлежат Аллаху и являются Его рабами, и Аллах заслуживает похвалы за то, что правит ими самым совершенным образом.',
  ),
  SurahEntity(
    name: 'Фатир',
    ayatCount: '45 аятов',
    id: 35,
    arabicName: 'فاطر',
    tafsirText:
        'Всевышний похвалил себя за сотворение небес, земли и всех живущих в них творений, потому что все сотворенное Аллахом свидетельствует о совершенстве Его могущества, власти, милосердия, мудрости и знания. Он сделал своими посланцами ангелов, и это – еще одно из похвальных деяний Господа. Ангелы отвечают за претворение в жизнь происходящих во Вселенной явлений и являются посредниками, доводящими до сведения творений послания Господа миров. ',
  ),
  SurahEntity(
    name: 'Йа Син',
    ayatCount: '83 аята',
    id: 36,
    arabicName: 'يس',
    tafsirText:
        'Всевышний Аллах поклялся Священным Кораном и назвал его мудрым, потому что Священный Коран расставляет все по своим местам. Все повеления, запреты и предписания этого Небесного Писания преисполнены мудрости. Аллах не только ниспослал в Священном Коране справедливые законоположения, но и сообщил Своим рабам об их смысле и мудрости. Он также научил правоверных обращать внимание на обстоятельства и прочие факторы, из которых вытекают те или иные законоположения.',
  ),
  SurahEntity(
    name: 'ас-Саффат',
    ayatCount: '182 аята',
    id: 37,
    arabicName: 'الصافات',
    tafsirText:
        'Всевышний поклялся благородными ангелами, которые поклоняются Ему и с Его позволения распоряжаются некоторыми делами Вселенной. Он принес эту клятву, дабы засвидетельствовать, что только Он – Единственный Господь Бог, достойный поклонения. Вначале Он поклялся ангелами, которые выстраиваются в ряды для того, чтобы исправно служить Ему. Затем Он поклялся ангелами, которые сгоняют облака и управляют другими природными явлениями. Наконец, Он поклялся ангелами, которые читают поминание, то есть перечитывают Его слова. А поскольку ангелы обожествляют только Его, поклоняются только Ему и никогда не ослушаются Его повелений, Господь поклялся ими в подтверждение истинности единобожия.',
  ),
  SurahEntity(
    name: 'Сад',
    ayatCount: '88 аятов',
    id: 38,
    arabicName: 'ص',
    tafsirText:
        'Всевышний засвидетельствовал величие Священного Корана и разъяснил отношение неверующих к этом Писанию и проповедовавшему его Посланнику. Поклявшись Кораном увещевающим, Всевышний Аллах подчеркнул ценность и важность Писания, которое открывает рабам Аллаха знание, в котором они так нуждаются.',
  ),
  SurahEntity(
    name: 'аз-Зумар',
    ayatCount: '75 аятов',
    id: 39,
    arabicName: 'الزمر',
    tafsirText:
        'Всевышний поведал Своим рабам о величии Священного Корана и могуществе Того, кто его изрек и ниспослал. А ниспослал его Всевышний Аллах, среди прекрасных имен которого – Могущественный, Мудрый. Только Он достоин обожествления и поклонения, потому что только Он обладает самыми совершенными качествами. Благодаря Своему могуществу Он правит Вселенной, а благодаря Своей мудрости Он творит и издает самые совершенные законы. Священный Коран является речью Аллаха, Который обладает такими прекрасными качествами. Дар речи также является одним из Его божественных качеств, а поскольку все качества Всевышнего Аллаха безупречны и бесподобны, то и Священный Коран является безупречным и бесподобным Писанием. Одно только это является достаточным свидетельством совершенства и величия последнего Небесного Откровения.',
  ),
  SurahEntity(
    name: 'Гафир',
    ayatCount: '85 аятов',
    id: 40,
    arabicName: 'غافر',
    tafsirText:
        'Всевышний сообщил о том, что Священный Коран ниспослан Единственным достойным поклонения Богом – Аллахом. Его божественные качества совершенны, а достойные похвалы деяния неповторимы. Ему покорны все творения, и Он осведомлен обо всем сущем. Он прощает грехи грешникам и принимает покаяния кающихся. Но вместе с тем Он сурово наказывает тех, кто осмеливается на совершение грехов и отказывается принести покаяние. ',
  ),
  SurahEntity(
    name: 'Фуссилят',
    ayatCount: '54 аята',
    id: 41,
    arabicName: 'فصلت',
    tafsirText:
        'Всевышний сообщил Своим рабам, что этот Священный Коран ниспослан Милостивым и Милосердным Аллахом, Чье милосердие объемлет все сущее. Одним из величайших проявлений Его милости к творениям является то, что Он ниспослал это Писание, которое несет с собой знания и верное руководство, свет и исцеление, милость и великое благо. ',
  ),
  SurahEntity(
    name: 'аш-Шура',
    ayatCount: '53 аята',
    id: 42,
    arabicName: 'الشورى',
    tafsirText:
        'Всевышний сообщил о том, что Он ниспослал Величественный Коран Мухаммаду, да благословит его Аллах и приветствует, так же, как некогда ниспосылал Откровения предшествовавшим ему пророкам и посланникам. Воистину, ниспослание Священных Писаний и отправление одного за другим пророков – милость Всевышнего Господа. Мухаммад – не первый из посланников, и его путь такой же, как и путь его предшественников. Его судьба похожа на их судьбу, а его учение – на их учения, ибо все они суть непреложная истина, ниспосланная Единственным Богом, достойным поклонения, Великим, Могущественным, Мудрым. Небеса и земля находятся в Его власти и подчинены Его законам и Его предопределению.',
  ),
  SurahEntity(
    name: 'аз-Зухруф',
    ayatCount: '89 аятов',
    id: 43,
    arabicName: 'الزخرف',
    tafsirText:
        'Это – клятва Священным Кораном, который Всевышний назвал Ясным Писанием. Он не подчеркнул, что именно разъясняет Коран, из чего следует, что рабы Аллаха могут найти в нем разъяснение всех мирских и религиозных вопросов, в знании которых они нуждаются.',
  ),
  SurahEntity(
    name: 'ад-Духан',
    ayatCount: '59 аятов',
    id: 44,
    arabicName: 'الدخان',
    tafsirText:
        'Всевышний поклялся Священным Кораном о том, что этот Коран действительно ниспослан Всемогущим Аллахом. Господь назвал его Ясным Писанием, ибо рабы Аллаха находят в нем разъяснение всего, в чем они нуждаются. Это Писание было ниспослано в ночь, которая принесла людям много добра. Это была ночь величия или ночь предопределения, которая лучше тысячи месяцев. Всевышний ниспослал самые прекрасные слова самому достойному из творений на великолепном арабском языке, дабы Его избранник увещевал ими несчастный народ, ослепленный собственным невежеством.',
  ),
  SurahEntity(
    name: 'аль-Джасия',
    ayatCount: '37 аятов',
    id: 45,
    arabicName: 'الجاثية',
    tafsirText:
        'Всевышний обязал всех верующих почитать Коран и заботиться о нем. Он ниспослан Единственным Богом и Благодетелем, обладающим самыми совершенными качествами, безграничным величием и безупречной мудростью.',
  ),
  SurahEntity(
    name: 'аль-Ахкаф',
    ayatCount: '35 аятов',
    id: 46,
    arabicName: 'الأحقاف',
    tafsirText:
        'Всевышний восславил и возвеличил Свое последнее откровение и сделал это, чтобы вдохновить Своих рабов на изучение Священного Корана и чтобы они осветили свои души его светом, задумались над его аятами и проникли в сокровищницу его мудростей. После того как Аллах возвестил о том, что именно Он ниспослал Священный Коран с его повелениями и запретами, Он напомнил Своим рабам о сотворении небес и земли. Тем самым Всевышний провозгласил Себя Творцом и Правителем. Он сказал: «Несомненно, Он творит и повелевает» (7:54); «Аллах – Тот, Кто сотворил семь небес и столько же земель. Повеление нисходит между ними» (65:12); «Он ниспосылает ангелов с духом (откровением) по Своему велению тому из Своих рабов, кому пожелает: “Предостерегайте тем, что нет божества, кроме Меня. Бойтесь же Меня”. Он сотворил небеса и землю ради истины» (16:2-3). Из множества Своих творений Аллах избрал людей и джиннов, которых наделил правом самостоятельно выбирать свой жизненный путь. Господь одарил их средой обитания, подчинил им небеса и землю и то, что в них, а затем отправил к ним Своих посланников и ниспослал Писания. Он приказал им совершать одно и избегать другого и сообщил, что земной мир преходящ и предназначен для труда и забот и что люди не останутся в нем навечно. Они умрут, но не исчезнут, а отправятся в мир иной, мир вечный, и возьмут с собой в путь дела, которые успели совершить за время своего пребывания на земле. Там, в Последней жизни, они получат воздаяние за все свои деяния.',
  ),
  SurahEntity(
    name: 'Мухаммад',
    ayatCount: '38 аятов',
    id: 47,
    arabicName: 'محمد',
    tafsirText:
        'В первых аятах этой суры Аллах сообщил о награде правоверных и наказании грешников для того, чтобы люди сделали для себя из этого полезные выводы. Среди людей есть главари неверия и проповедники заблуждения, которые не только не веруют в Аллаха и Его знамения, но и мешают другим встать на Его путь, то есть уверовать в то, к чему призывали посланники и продолжают призывать их верные последователи. Деяния этих нечестивцев окажутся тщетными и принесут им много страданий. Они будут отвечать за свои зловещие поступки и за те козни, которые они замышляли против истины и ее сторонников. Аллах обратил их коварные замыслы против них самих и превратил в прах те деяния, за которые они надеялись получить вознаграждение. А причина этого в том, что они следовали лжи и не стремились снискать благоволение Аллаха. Они поклонялись идолам и ложным богам и всеми силами способствовали распространению лжи. А поскольку ложь никому не приносит пользы, то и дела этих грешников не принесут им никакой пользы.',
  ),
  SurahEntity(
    name: 'аль-Фатх',
    ayatCount: '29 аятов',
    id: 48,
    arabicName: 'الفتح',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    name: 'аль-Худжурат',
    ayatCount: '18 аятов',
    id: 49,
    arabicName: 'الحجرات',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 50,
    name: 'Каф',
    arabicName: 'ق',
    ayatCount: '45 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 51,
    name: 'аз-Зарият',
    arabicName: 'الذاريات',
    ayatCount: '60 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 52,
    name: 'ат-Тур',
    arabicName: 'الطور',
    ayatCount: '49 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 53,
    name: 'ан-Наджм',
    arabicName: 'النجم',
    ayatCount: '62 аята',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 54,
    name: 'аль-Камар',
    arabicName: 'القمر',
    ayatCount: '55 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 55,
    name: 'ар-Рахман',
    arabicName: 'الرحمن',
    ayatCount: '78 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 56,
    name: 'аль-Вакиа',
    arabicName: 'الواقعة',
    ayatCount: '96 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 57,
    name: 'аль-Хадид',
    arabicName: 'الحديد',
    ayatCount: '29 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 58,
    name: 'аль-Муджадиля',
    arabicName: 'المجادلة',
    ayatCount: '22 аята',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 59,
    name: 'аль-Хашр',
    arabicName: 'الحشر',
    ayatCount: '24 аята',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 60,
    name: 'аль-Мумтахана',
    arabicName: '	الممتحنة',
    ayatCount: '13 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 61,
    name: 'ас-Сафф',
    arabicName: '	الصف',
    ayatCount: '14 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 62,
    name: 'аль-Джумуа',
    arabicName: 'الجمعة',
    ayatCount: '11 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 63,
    name: 'аль-Мунафикун',
    arabicName: 'المنافقون',
    ayatCount: '11 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 64,
    name: 'ат-Тагабун',
    arabicName: 'التغابن',
    ayatCount: '18 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 65,
    name: 'ат-Таляк',
    arabicName: 'الطلاق',
    ayatCount: '12 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 66,
    name: 'ат-Тахрим',
    arabicName: 'التحريم',
    ayatCount: '12 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 67,
    name: 'аль-Мульк',
    arabicName: 'الملك',
    ayatCount: '30 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 68,
    name: 'аль-Калям',
    arabicName: 'القلم',
    ayatCount: '52 аята',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 69,
    name: 'аль-Хакка',
    arabicName: 'الحاقة',
    ayatCount: '52 аята',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 70,
    name: 'аль-Мааридж',
    arabicName: 'المعارج',
    ayatCount: '44 аята',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 71,
    name: 'Нух',
    arabicName: 'نوح',
    ayatCount: '28 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 72,
    name: 'аль-Джинн',
    arabicName: 'الجن',
    ayatCount: '28 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 73,
    name: 'аль-Муззаммиль',
    arabicName: 'المزمل',
    ayatCount: '20 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 74,
    name: 'аль-Муддассир',
    arabicName: 'المدثر',
    ayatCount: '56 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 75,
    name: 'аль-Кияма',
    arabicName: 'القيامة',
    ayatCount: '40 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 76,
    name: 'аль-Инсан',
    arabicName: 'الإنسان',
    ayatCount: '31 аят',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 77,
    name: 'аль-Мурсалят',
    arabicName: '	المرسلات',
    ayatCount: '50 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 78,
    name: 'ан-Наба',
    arabicName: 'النبأ',
    ayatCount: '40 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 79,
    name: 'ан-Назиат',
    arabicName: 'النازعات',
    ayatCount: '46 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 80,
    name: 'Абаса',
    arabicName: 'عبس',
    ayatCount: '42 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 81,
    name: 'ат-Таквир',
    arabicName: 'التكوير',
    ayatCount: '29 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 82,
    name: 'аль-Инфитар',
    arabicName: 'الانفطار',
    ayatCount: '19 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 83,
    name: 'аль-Мутаффифин',
    arabicName: 'المطففون',
    ayatCount: '36 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 84,
    name: 'аль-Иншикак',
    arabicName: 'الانشقاق',
    ayatCount: '25 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 85,
    name: 'аль-Бурудж',
    arabicName: 'البروج',
    ayatCount: '22 аята',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 86,
    name: 'ат-Тарик',
    arabicName: 'الطارق',
    ayatCount: '17 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 87,
    name: 'аль-Аля',
    arabicName: 'الأعلى',
    ayatCount: '19 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 88,
    name: 'аль-Гашия',
    arabicName: 'الغاشية',
    ayatCount: '26 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 89,
    name: 'аль-Фаджр',
    arabicName: 'الفجر',
    ayatCount: '30 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 90,
    name: 'аль-Баляд',
    arabicName: 'البلد',
    ayatCount: '20 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 91,
    name: 'аш-Шамс',
    arabicName: 'الشمس',
    ayatCount: '15 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 92,
    name: 'аль-Ляйль',
    arabicName: 'الليل',
    ayatCount: '21 аят',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 93,
    name: 'ад-Духа',
    arabicName: 'الضحى',
    ayatCount: '11 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 94,
    name: 'аш-Шарх',
    arabicName: 'الشرح',
    ayatCount: '8 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 95,
    name: 'ат-Тин',
    arabicName: 'التين',
    ayatCount: '8 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 96,
    name: 'аль-Аляк',
    arabicName: 'العلق',
    ayatCount: '19 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 97,
    name: 'аль-Кадр',
    arabicName: 'القدر',
    ayatCount: '5 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 98,
    name: 'аль-Баййина',
    arabicName: 'البينة',
    ayatCount: '8 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 99,
    name: 'аз-Зальзаля',
    arabicName: 'الزلزلة',
    ayatCount: '8 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 100,
    name: 'аль-Адият',
    arabicName: 'العاديات',
    ayatCount: '11 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 101,
    name: 'аль-Кариа',
    arabicName: 'القارعة',
    ayatCount: '11 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 102,
    name: 'ат-Такасур',
    arabicName: 'التكاثر',
    ayatCount: '8 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 103,
    name: 'аль-Аср',
    arabicName: 'العصر',
    ayatCount: '3 аята',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 104,
    name: 'аль-Хумаза',
    arabicName: 'الهمزة',
    ayatCount: '9 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 105,
    name: 'аль-Филь',
    arabicName: 'الفيل',
    ayatCount: '5 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 106,
    name: 'Курайш',
    arabicName: 'قريش',
    ayatCount: '4 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 107,
    name: 'аль-Маун',
    arabicName: 'الماعون',
    ayatCount: '7 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 108,
    name: 'аль-Кавсар',
    arabicName: 'الكوثر',
    ayatCount: '3 аята',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 109,
    name: 'аль-Кафирун',
    arabicName: 'الكافرون',
    ayatCount: '6 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 110,
    name: 'ан-Наср',
    arabicName: 'النصر',
    ayatCount: '3 аята',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 111,
    name: 'аль-Масад',
    arabicName: 'المسد',
    ayatCount: '5 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 112,
    name: 'аль-Ихляс',
    arabicName: 'الإخلاص',
    ayatCount: '4 аята',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 113,
    name: 'аль-Фаляк',
    arabicName: 'الفلق',
    ayatCount: '5 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
  SurahEntity(
    id: 114,
    name: 'ан-Нас',
    arabicName: 'الناس',
    ayatCount: '6 аятов',
    tafsirText:
        'Упомянутая в этом аяте победа – это заключение Худейбийского мира. После того как язычники не дали возможности посланнику Аллаха, да благословит его Аллах и приветствует, совершить умру, то есть малое паломничество в Мекку, он решил заключить с ними мирный договор, по которому обе стороны согласились не воевать друг против друга в течение десяти лет, а посланник Аллаха, да благословит его Аллах и приветствует, согласился перенести паломничество на будущий год.',
  ),
];
